InformationRegisters/общ_СоставПрофилейДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>общ_СоставПрофилейДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_ПрофилиДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/общ_ВидыПрофилейДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>общ_ВидыПрофилейДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КазначейскиеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РолиИнформационнойБазы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/общ_СоставПрофилейДоступа/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.Профиль) И ЗначениеЗаполнено(ТекущийОбъект.Пользователь) Тогда
		Если ТекущийОбъект.Профиль.ВидПрофиляДоступа = Перечисления.общ_ВидыПрофилейДоступа.РолиИнформационнойБазы Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	общ_СоставПрофилейДоступа.Профиль
				|ИЗ
				|	РегистрСведений.общ_СоставПрофилейДоступа КАК общ_СоставПрофилейДоступа
				|ГДЕ
				|	общ_СоставПрофилейДоступа.Пользователь = &Пользователь
				|	И общ_СоставПрофилейДоступа.Профиль <> &Профиль";

			Запрос.УстановитьПараметр("Пользователь", 	ТекущийОбъект.Пользователь);
			Запрос.УстановитьПараметр("Профиль", 		ТекущийОбъект.Профиль);

			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				куфиб_ОбщегоНазначения.СообщитьПользователю("Пользователь уже включен в профиль доступа:");
			КонецЕсли;

			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				куфиб_ОбщегоНазначения.СообщитьПользователю(Строка(ВыборкаДетальныеЗаписи.Профиль));
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Профиль.ВидПрофиляДоступа = Перечисления.общ_ВидыПрофилейДоступа.РолиИнформационнойБазы Тогда
		общ_УправлениеПрофилямиДоступа.ПрименитьПараметрыПрофиляДоступаКИнформационнойБазе(ТекущийОбъект.Пользователь,ТекущийОбъект.Профиль);
	КонецЕсли;
КонецПроцедуры
